Podkova/src/Catalogs/ШМ_СтойкаВТочках/ШМ_СтойкаВТочках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШМ_СтойкаВТочках</name>
  <attributes>
    <name>Диаметр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Брэнд</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сезон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Год</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Podkova/src/InformationRegisters/ШМ_Стойка/ШМ_Стойка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШМ_Стойка</name>
  <attributes>
    <name>Продано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Восстановить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ТочкаПродажи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураТекст</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПоступления</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПродажи</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник1</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник2</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник3</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦенаПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Комплект</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Радиус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Бренд</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Зимняя</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПродалСотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДолженЗабратьДеньгиСотрудник1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДолженЗабратьДеньгиСотрудник2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДолженЗабратьДеньгиСотрудник3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Podkova/src/Catalogs/ШМ_СтойкаВТочках/Forms/ФормаСписка/Module.bsl
&НаСервере
Функция ТочкаСтороняя(ТчкНаим)
	
	Рез=Ложь;
	ВыбСторонниеТочки = Справочники.СторонниеТочки.Выбрать();
	Пока ВыбСторонниеТочки.Следующий() Цикл
		Если Найти(ВыбСторонниеТочки.Наименование,ТчкНаим)>0 Тогда
			Рез=Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Рез; 
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ВыбШМ_СтойкаВТочках=Справочники.ШМ_СтойкаВТочках.Выбрать();
	//Пока ВыбШМ_СтойкаВТочках.Следующий() Цикл
		//Если ТочкаСтороняя(ВыбШМ_СтойкаВТочках.Наименование)=Истина Тогда
		//	Продолжить;
		//КонецЕсли;
		////Удаляем
		//ОбжСтойкаВТочках=ВыбШМ_СтойкаВТочках.ПолучитьОбъект();
		//ОбжСтойкаВТочках.Удалить();
	//КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШМ_Стойка.Продано КАК Продано,
		|	ШМ_Стойка.Номенклатура КАК Номенклатура,
		|	ШМ_Стойка.НоменклатураТекст КАК НоменклатураТекст,
		|	ШМ_Стойка.ДатаПоступления КАК ДатаПоступления,
		|	ШМ_Стойка.Идентификатор КАК Идентификатор,
		|	ШМ_Стойка.ДатаПродажи КАК ДатаПродажи,
		|	ШМ_Стойка.Комплект КАК Комплект,
		|	ШМ_Стойка.Цена КАК Цена,
		|	ШМ_Стойка.ЦенаПродажи КАК ЦенаПродажи,
		|	ШМ_Стойка.Артикул КАК Артикул,
		|	ШМ_Стойка.Радиус КАК Радиус,
		|	ШМ_Стойка.Ширина КАК Ширина,
		|	ШМ_Стойка.Высота КАК Высота,
		|	ШМ_Стойка.Бренд КАК Бренд,
		|	ШМ_Стойка.Зимняя КАК Зимняя,
		|	ШМ_Стойка.Год КАК Год,
		|	ШМ_Стойка.ПродалСотрудник КАК ПродалСотрудник,
		|	ШМ_Стойка.Сотрудник1 КАК Сотрудник1,
		|	ШМ_Стойка.Сотрудник2 КАК Сотрудник2,
		|	ШМ_Стойка.Сотрудник3 КАК Сотрудник3
		|ИЗ
		|	РегистрСведений.ШМ_Стойка КАК ШМ_Стойка
		|ГДЕ
		|	ШМ_Стойка.Продано = ЛОЖЬ
		|	И ШМ_Стойка.ТочкаПродажи <> &ТочкаПродажи";  
	
	ТекущееРабочееМесто = МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();
	ТочкаПродажи = СтрРазделить(ТекущееРабочееМесто, " "); 
	Запрос.УстановитьПараметр("ТочкаПродажи", ТочкаПродажи[0]);
	Выборка = Запрос.Выполнить().Выгрузить();
	
	ТаблВыборкиСтойки = Новый ТаблицаЗначений;	
	ТаблВыборкиСтойки.Колонки.Добавить("Наим");
	ТаблВыборкиСтойки.Колонки.Добавить("Диаметр");
	ТаблВыборкиСтойки.Колонки.Добавить("Брэнд");
	ТаблВыборкиСтойки.Колонки.Добавить("Сезон");
	ТаблВыборкиСтойки.Колонки.Добавить("Цена");
	ТаблВыборкиСтойки.Колонки.Добавить("Количество");
	ТаблВыборкиСтойки.Колонки.Добавить("Ширина");
	ТаблВыборкиСтойки.Колонки.Добавить("Высота");
	ТаблВыборкиСтойки.Колонки.Добавить("Артикул");
	ТаблВыборкиСтойки.Колонки.Добавить("Год");
	
	
	Для Каждого СтрокаВыборка Из Выборка Цикл
		СтрокаТаблВыборкиСтойки = ТаблВыборкиСтойки.Добавить();	 
		ТекущееРабочееМесто = МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();    
		ТочкаПродажи = СтрРазделить(ТекущееРабочееМесто, " ");
		СтрокаТаблВыборкиСтойки.Наим = ТочкаПродажи[0];
		СтрокаТаблВыборкиСтойки.Диаметр = СтрокаВыборка.Радиус;
		СтрокаТаблВыборкиСтойки.Брэнд = СтрокаВыборка.Бренд;
		Если СтрокаВыборка.Зимняя = Истина Тогда
			СтрокаТаблВыборкиСтойки.Сезон = "Зимняя";
		Иначе
			СтрокаТаблВыборкиСтойки.Сезон = "Летняя";
		КонецЕсли;
		СтрокаТаблВыборкиСтойки.Цена=СтрокаВыборка.Цена;
		СтрокаТаблВыборкиСтойки.Количество=1;
		СтрокаТаблВыборкиСтойки.Ширина=СтрокаВыборка.Ширина;
		СтрокаТаблВыборкиСтойки.Высота=СтрокаВыборка.Высота;
		СтрокаТаблВыборкиСтойки.Артикул=СтрокаВыборка.Артикул;
		СтрокаТаблВыборкиСтойки.Год=СтрокаВыборка.Год;
	КонецЦикла;
	
	ТаблВыборкиСтойки.Свернуть("Наим,Диаметр,Брэнд,Сезон,Цена,Ширина,Высота,Артикул,Год","Количество");
	
	Для Каждого СтрокаТаблВыборкиСтойки Из ТаблВыборкиСтойки Цикл
		НовЭл=Справочники.ШМ_СтойкаВТочках.СоздатьЭлемент();
		НовЭл.Наименование=СтрокаТаблВыборкиСтойки.Наим;
		НовЭл.Диаметр=СтрокаТаблВыборкиСтойки.Диаметр;
		НовЭл.Брэнд=СтрокаТаблВыборкиСтойки.Брэнд;
		НовЭл.Сезон=СтрокаТаблВыборкиСтойки.Сезон;
		НовЭл.Цена=СтрокаТаблВыборкиСтойки.Цена;
		НовЭл.Количество=СтрокаТаблВыборкиСтойки.Количество;
		НовЭл.Ширина=СтрокаТаблВыборкиСтойки.Ширина;
		НовЭл.Высота=СтрокаТаблВыборкиСтойки.Высота;
		//НовЭл.Артикул=СтрокаТаблВыборкиСтойки.Артикул;
		//НовЭл.Год=СтрокаТаблВыборкиСтойки.Год;
		НовЭл.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Продать(Команда)
	
	ФормаСтойки=ПолучитьФорму("Обработка.Шиномонтаж.Форма.Стойка");
	ТекСтрока=Элементы.Список.ТекущиеДанные;
	ФормаСтойки.СтрокаПоискаПоРазмеру=ТекСтрока.Ширина+ТекСтрока.Высота+ТекСтрока.Диаметр;
	//Если СокрЛП(ТекСтрока)="Зимняя" Тогда
	//	ФормаСтойки.ПоискЗимняя=Истина;
	//	ФормаСтойки.ПоискЛетняя=Ложь;
	//Иначе
	//	ФормаСтойки.ПоискЗимняя=Ложь;
	//	ФормаСтойки.ПоискЛетняя=Истина;
	//КонецЕсли;
	ФормаСтойки.Открыть();
	//ФормаСтойки.ПоискПоРазмеруПриИзменении(ФормаСтойки.СтрокаПоискаПоРазмеру);
	ФормаСтойки.ПоискПоРазмеруНаСервере(ТекСтрока.Ширина,ТекСтрока.Высота,ТекСтрока.Диаметр);
	//ОткрытьФорму("Обработка.Шиномонтаж.Форма.Стойка");
	ЭтаФорма.Закрыть();
КонецПроцедуры
